/*
  String_ui.strings
  iina

  Created by lhc on 3/1/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
// Common

"general.on" = "开";
"general.off" = "关";
"general.login" = "登录";
"general.logout" = "登出";
"general.ok" = "确定";
"general.cancel" = "取消";
"general.username" = "用户名";
"general.password" = "密码";
"general.na" = "N/A";

"input.value_is_empty" = "数值不能为空";
"input.already_exists" = "值已经存在。";

// Guide Window
"guide.highlights" = "更新亮点";
"guide.basic_settings" = "基本设置";
"guide.faq" = "常见问题";

// Initial Window
"initial.announcement" = "您正在使用 IINA 的 %@ 版本";
"initial.beta.desc" = "如果你想回滚到发布版本，请从“设置” > “通用” 中取消勾选 “接收测试版本（Beta）更新”，并从我们的<a href=\"https://iina.io\">官方网站</a>安装一个稳定版本。";
"initial.nightly.desc" = "我们不建议将 Nightly 作为日常使用的版本。目前 Nightly 不支持自动更新。请从我们的<a href=\"https://nightly.iina.io\"> Nightly 网站</a>手动下载更新的版本。";
"initial.debug.desc" = "调试版本（Debug）通常没有对性能进行优化，所以不建议日常用。调试版本（Debug）不支持自动更新。";
"initial.bug_report" = "通过<a href=\"https://github.com/iina/iina/issues\">GitHub issues</a>报告。";

// Inspector Window
"inspector.error" = "错误";

// MainWindowController.swift
"main.buffering_indicator" = "缓冲中… %d%%";
"main.opening_stream" = "正在打开流媒体……";
"main.seeking_indicator" = "检索中…";
"osc.precision" = "精确度";
"osc.1s" = "1秒";
"osc.100ms" = "100毫秒";
"osc.10ms" = "10毫秒";
"osc.1ms" = "1毫秒";

// QuickSettingViewController.swift
"quicksetting.item_default" = "默认";
"quicksetting.item_none" = "无";
"quicksetting.hwdec" = "硬件解码";
"quicksetting.deinterlace" = "反交错";
"quicksetting.hdr" = "HDR";
"quicksetting.hide" = "隐藏";
"quicksetting.reset_speed" = "原速";

// EQ Presets
"eq.preset.flat" = "平坦";
"eq.preset.acoustic" = "原声";
"eq.preset.classical" = "古典";
"eq.preset.dance" = "舞曲";
"eq.preset.deep" = "深";
"eq.preset.electronic" = "电子乐";
"eq.preset.hip_hop" = "嘻哈";
"eq.preset.increase_bass" = "增加低音";
"eq.preset.increase_treble" = "增加高音";
"eq.preset.increase_vocal" = "增加人声";
"eq.preset.jazz" = "爵士";
"eq.preset.latin" = "拉丁音乐";
"eq.preset.loundness" = "响度";
"eq.preset.lounge" = "驰放音乐";
"eq.preset.piano" = "钢琴音乐";
"eq.preset.pop" = "流行音乐";
"eq.preset.rnb" = "节奏蓝调";
"eq.preset.reduce_bass" = "减少低音";
"eq.preset.reduce_treble" = "减少高音";
"eq.preset.rock" = "摇滚";
"eq.preset.small_speaker" = "小型扬声器";
"eq.preset.spoken_word" = "朗诵诗音乐";

"alert.eq.new_profile.title" = "新EQ 配置文件";
"alert.eq.new_profile.message" = "请输入个人资料名称。";
"alert.eq.rename.title" = "重命名当前配置文件";
"alert.eq.rename.message" = "请输入新的配置文件名称：";

// OSDMessage.swift
"osd.pause" = "暂停";
"osd.resume" = "继续";
"osd.volume" = "音量：%@";
"osd.speed" = "速度：%@x";
"osd.aspect" = "长宽比：%@";
"osd.crop" = "裁切：%@";
"osd.rotate" = "旋转：%i°";
"osd.deinterlace" = "反交错：%@";
"osd.hwdec" = "正在硬件解码: %@";
"osd.audio_delay.nodelay" = "音频延迟：无延迟";
"osd.audio_delay.later" = "音频延迟：延迟 %@ 秒";
"osd.audio_delay.earlier" = "音频延迟：提前 %@ 秒";
"osd.sub_delay.nodelay" = "字幕延迟：无延迟";
"osd.sub_delay.later" = "字幕延迟：延迟 %@ 秒";
"osd.sub_delay.earlier" = "字幕延迟：提前 %@ 秒";
"osd.subtitle_pos" = "字幕位置：%@";
"osd.sub_hidden" = "字幕已隐藏";
"osd.sub_visible" = "字幕可见";
"osd.sub_second_delay.nodelay" = "二级字幕延迟：无延迟";
"osd.sub_second_delay.later" = "二级字幕延迟：延迟 %@ 秒";
"osd.sub_second_delay.earlier" = "二级字幕延迟：提前 %@ 秒";
"osd.sub_second_hidden" = "隐藏二级字幕";
"osd.sub_second_pos" = "二级字幕位置：%@";
"osd.sub_second_visible" = "开启二级字幕";
"osd.mute" = "静音";
"osd.unmute" = "取消静音";
"osd.screenshot" = "已截图";
"osd.abloop.a" = "AB循环：A";
"osd.abloop.b" = "AB循环：B";
"osd.abloop.clear" = "AB循环：清除";
"osd.stop" = "停止";
"osd.chapter" = "章节：%@";
"osd.subtitle_scale" = "字幕缩放：%@x";
"osd.add_to_playlist" = "已添加 %i 个文件至播放列表";
"osd.clear_playlist" = "清除播放列表";
"osd.video_eq.contrast" = "对比度：%i";
"osd.video_eq.gamma" = "伽玛: %i";
"osd.video_eq.hue" = "色调：%i";
"osd.video_eq.saturation" = "饱和度：%i";
"osd.video_eq.brightness" = "亮度：%i";
"osd.find_online_sub" = "正在查找在线字幕…";
"osd.find_online_sub.source" = "从";
"osd.sub_not_found" = "查无字幕";
"osd.sub_found" = "找到 %d 字幕。";
"osd.sub_downloading" = "正在下载 %d 字幕";
"osd.sub_downloaded" = "字幕已下载";
"osd.sub_saved" = "字幕已保存";
"osd.network_error" = "网络错误";
"osd.file_error" = "读取文件错误";
"osd.cannot_login" = "无法登录";
"osd.canceled" = "已取消";
"osd.cannot_connect" = "无法连接";
"osd.timed_out" = "超时";
"osd.filter_added" = "已添加滤镜: %@";
"osd.filter_removed" = "已移除滤镜";
"osd.file_loop" = "循环单个文件";
"osd.playlist_loop" = "循环播放列表";
"osd.no_loop" = "禁用循环";

"preference.title" = "偏好设置";
"preference.general" = "通用";
"preference.ui" = "用户界面";
"preference.video_audio" = "视频/音频";
"preference.subtitle" = "字幕";
"preference.network" = "网络";
"preference.control" = "控制";
"preference.keybindings" = "键位设置";
"preference.advanced" = "高级";
"preference.plugins" = "插件";
"preference.utilities" = "实用工具";
"preference.scripts" = "脚本";
"preference.not_logged_in" = "未登录";
"preference.logged_in_as" = "已登录为 %@";
"preference.system_media_control" = "使用系统媒体控制";

"preference.key_binding_hint_1" = "若要在此配置文件中编辑键位设置，先点击「复制…」按钮以创建一个副本。";
"preference.key_binding_hint_2" = "双击右边的任意一行以编辑对应键位设置。";

"preference.enable_adv_settings" = "启用高级设置";

"preference.sub_override_level.no" = "不";
"preference.sub_override_level.force" = "强制";
"preference.sub_override_level.scale" = "缩放";
"preference.sub_override_level.strip" = "条形";
"preference.sub_override_level.yes" = "是";

"preference.sub_override_level.descriptive_text.no" = "按照字幕脚本的指定渲染字幕，不覆盖。";
"preference.sub_override_level.descriptive_text.force" = "应用所有字幕样式。";
"preference.sub_override_level.descriptive_text.scale" = "在除本节中的样式设置外应用音阶设置";
"preference.sub_override_level.descriptive_text.strip" = "从字幕中彻底去掉所有的ASS标签和样式。";
"preference.sub_override_level.descriptive_text.yes" = "应用本节中的所有样式设置。";

"preference.ytdl_plugin_not_installed" = "从 \"Plugins > 安装 GitHub\" 中安装在线媒体插件以享受高级功能，例如视频下载和自动yt-dlp 更新。";
"preference.ytdl_plugin_installed" = "由于安装了在线媒体插件，内置的 youtube-dl 支持已被禁用。";

"menu.volume" = "音量: %@";
"menu.volume_muted" = "音量：%@（静音）";
"menu.audio_delay" = "音频延迟: %@秒";
"menu.sub_delay" = "字幕延迟: %@秒";
"menu.sub_hide" = "隐藏字幕";
"menu.sub_show" = "显示字幕";
"menu.sub_second_hide" = "隐藏二级字幕";
"menu.sub_second_show" = "显示二级字幕";
"menu.fullscreen" = "进入全屏模式";
"menu.exit_fullscreen" = "退出全屏";
"menu.pip" = "进入「画中画」模式";
"menu.exit_pip" = "退出「画中画」模式";
"menu.mini_player" = "进入音乐模式";
"menu.exit_mini_player" = "退出音乐模式";
"menu.pause" = "暂停";
"menu.resume" = "继续";
"menu.speed" = "播放速度";
"menu.chapters" = "显示章节面板";
"menu.hide_chapters" = "隐藏章节面板";
"menu.playlist" = "显示播放列表面板";
"menu.hide_playlist" = "隐藏播放列表面板";
"menu.video" = "显示视频面板";
"menu.hide_video" = "隐藏视频面板";
"menu.audio" = "显示音频面板";
"menu.hide_audio" = "隐藏音频面板";
"menu.subtitles" = "显示字幕面板";
"menu.hide_subtitles" = "隐藏字幕面板";

"menu.seek_forward" = "渐进 %@秒";
"menu.seek_backward" = "渐退 %@秒";
"menu.speed_up" = "加速 %@ 倍";
"menu.speed_down" = "减速 %@ 倍";
"menu.volume_up" = "音量 + %@%%";
"menu.volume_down" = "音量 - %@%%";
"menu.audio_delay_up" = "音频延迟 + %@秒";
"menu.audio_delay_down" = "音频延迟 - %@秒";
"menu.sub_delay_up" = "字幕延迟 + %@秒";
"menu.sub_delay_down" = "字幕延迟 - %@秒";

"menu.crop_custom" = "自定义…";
"menu.find_online_sub" = "从 %@ 查找在线字幕";

"menu.manage_plugins" = "菜单管理器插件";
"menu.developer_tool" = "菜单开发者工具";
"menu.more_plugin" = "更多…";
"menu.conflicting_shortcuts" = "相互冲突的快捷键…";
"menu.reload_plugins" = "重新加载所有插件";
"menu.show_plugins_panel" = "显示插件面板";
"menu.hide_plugins_panel" = "隐藏插件面板";

"track.audio" = "音频";
"track.none" = "<无>";
"track.sub" = "字幕";
"track.video" = "视频";

"subtrack.no_loaded" = "无字幕加载";
"subtrack.no_external" = "未找到外挂字幕";

// Alerts
"alert.beta_channel.title" = "接收测试版（Beta）更新";

"alert.title_error" = "错误";
"alert.title_warning" = "警告";
"alert.title_info" = "提示";

"alert.fatal_error" = "严重错误：%@ \n程序将立即终止。";
"alert.mpv_error" = "出现内部错误 %@（%@）(设定选项 %@ 时)。";

"alert.unsupported_audio" = "不支持的外置音频文件。";
"alert.unsupported_video" = "不支持的外部视频文件。";
"alert.unsupported_sub" = "不支持的外挂字幕。";
"alert.unsupported_url" = "不支持的 URL。";
"alert.wrong_url_format" = "URL 格式错误。";

"alert.error_open" = "无法打开文件或流媒体！";
"alert.error_finding_file" = "无法找到文件 %@！";
"alert.error_loading_script" = "无法加载脚本 %@！";
"alert.error_saving_file" = "保存 %@时出错： %@";
"alert.error_deleting_file" = "无法删除该文件。";

"alert.target_peak.bad_value" = "数值 “%@” 是无效的。\n请提供一个介于 10 和 10000 之间的数值，或 0。";

"alert.config.new.title" = "新建输入配置";
"alert.config.new.message" = "请为此新配置输入名称。";
"alert.config.duplicate.title" = "复制配置";
"alert.config.duplicate.message" = "请为此复制配置文件输入名称。";
"alert.config.file_existing.title" = "同名文件已存在";
"alert.config.file_existing.message" = "一个具有相同文件名的配置文件已存在。选择“确定”在Finder中显示该文件。";
"alert.config.cannot_create" = "无法创建配置文件！\n%@";
"alert.config.cannot_write" = "无法写入配置文件！";
"alert.config.rename.title" = "重命名输入配置";
"alert.config.rename.message" = "请输入新的配置名称。";

"alert.filter.incorrect" = "设置过滤器时出错。请检查您的参数格式。";
"alert.add_filter.title" = "添加新滤镜";
"alert.add_filter.message" = "请输入符合 mpv 的 vf 或 af 格式的滤镜字符串。";

"alert.keybinding_config.error" = "无法读取快捷键配置文件“%@”！已回退至 IINA 默认的键位设置。请检查你的快捷键配置。";

"alert.extra_option.cannot_read" = "无法读取用户定义的 mpv 额外选项。";
"alert.extra_option.empty" = "键或值不能为空！";
"alert.extra_option.error" = "无法设置选项 --%@=%@ （返回值 %d）。 请在「设置>高级」中检查您的额外 mpv 选项。";
"alert.extra_option.config_folder" = "设置配置文件目录 \"%@\" 时出错。";

"alert.playlist.error_deleting" = "删除 %@ 时出错。";

"alert.screenshot.error_taking" = "截图失败！";

"alert.sub.no_selected" = "请先选择一个已下载字幕。";
"alert.sub_lang_not_set" = "请在使用 opensubtitles 之前设定字幕语言. 此次将会使用英语（eng） 。\n\n0.0.7 之后默认的字幕来源将会是 opensubtitles。如果您是中文用户，请在「偏好设置 > 字幕」中确认「字幕来源」为「shooter.cn」，以继续使用射手字幕。";
"alert.sub.cannot_save_passwd" = "无法将密码保存到钥匙串：%@";
"alert.sub.cannot_login" = "无法登录。请检查您的用户名、密码及网络状态。\n\n%@";
"alert.sub.save_downloaded.title" = "保存已下载字幕";

"alert.set_default.title" = "正在将 IINA 设为默认程序";
"alert.set_default.message" = "IINA 将作为默认程序打开所有支持文件类型。";
"alert.set_default.success" = "已完成。%d 成功，%d 失败。";

"alert.add_watch.title" = "添加监视属性";
"alert.add_watch.message" = "请输入一个有效的 mpv 属性名称。";

"alert.jump_to.title" = "跳转至";
"alert.jump_to.message" = "请输入所要跳转的时间。例如: 20:35";

"alert.opensub.login.title" = "OpenSubtitles 登录";
"alert.opensub.login.message" = "请输入用户名和密码。";

"alert.open_url.title" = "打开 URL";
"alert.open_url.message" = "请输入 URL:";
"alert.choose_media_file.title" = "选择媒体文件";

"alert.add_url.title" = "添加 URL";
"alert.add_url.message" = "请输入 URL:";

"alert.delete_history.title" = "删除播放历史记录";
"alert.delete_history.message" = "确定删除所选项目？";

"alert.filter_hwdec.message" = "你正在添加视频滤镜。然而，当前的硬件解码器不能很好地支持视频滤镜。你可以禁用硬件解码，或使用支持“拷贝”的解码器（将占用两倍内存）。\n你可能需要再操作一次（例如剪切）才能看到效果。";
"alert.filter_hwdec.abort" = "放弃";
"alert.filter_hwdec.turn_off" = "关闭硬件解码";
"alert.filter_hwdec.use_copy" = "使用“自动（拷贝）”解码器";

"alert.clear_cache.title" = "清除缩略图缓存";
"alert.clear_cache.message" = "确定清除所有缩略图缓存？";

"alert.clear_history.title" = "清除播放历史";
"alert.clear_history.message" = "确定删除所有播放历史吗？";

"alert.clear_watch_later.title" = "清除已保存的播放进度";
"alert.clear_watch_later.message" = "确定清除所有保存的播放进度（即“watch later”）数据吗？";

"alert.restore_alerts.title" = "还原已忽略的警告";
"alert.restore_alerts.message" = "您确定要还原已忽略的警告吗？";

"alert.nothing_to_open" = "无文件可打开。";

"alert.no_video_track" = "无视频轨道。";

"alert.duplicate_config" = "您无法直接编辑默认配置。请先复制后再编辑。";

"alert.assrt_register" = "由于 API 配额限制，我们强烈建议您使用自己的 API token。默认 API token 仅做测试用途，且您有可能遇到网络错误。";
"alert.assrt_register.register" = "立即注册";
"alert.assrt_register.try" = "试用一下";
"alert.assrt_token_prompt.title" = "输入您的 API token";
"alert.assrt_token_prompt.message" = "请在弹出网页中注册帐号。在您个人首页中获得 token 并在下方输入:";
"alert.assrt_token_invalid" = "您的 Assrt API token 疑似无效。";

"alert.plugin_uninstall.title" = "你确定要卸载 %@ 吗？";
"alert.plugin_uninstall.message" = "插件将从您的硬盘中删除。";
"alert.plugin_reinstall.title" = "插件 %@ 已存在";
"alert.plugin_reinstall.message" = "您希望重新安装此插件吗？";
"alert.duplicated_plugin_id" = "检测到重复的插件标识符。两个或多个插件具有相同的标识符“%@”，这可能会导致异常行为。 请在首选项 - 插件中找到它们，并向插件作者报告。 如果插件是本地安装的，您也可以手动更改插件的 Info.json 文件中的标识符。";
"alert.plugin_no_update" = "没有发现更新。";
"alert.plugin_update_found.title" = "找到 %@ 的更新";
"alert.plugin_update_found.message" = "最新版本是 %@。您有 %@。您想要更新吗？";
"alert.plugin_permission" = "此插件需要以下权限，请在继续之前检查。";
"alert.plugin_permission_added" = "此次更新需要额外给予以下权限，请在继续之前检视。";

"playlist.total_length" = "总计 %@";
"playlist.total_length_with_selected" = "选中 %@ / %@";
"playlist.sorting.header" = "排序";
"playlist.sorting.filename_ascending" = "文件名升序";
"playlist.sorting.filename_descending" = "文件名降序";
"playlist.sorting.path_ascending" = "文件路径升序";
"playlist.sorting.path_descending" = "文件路径降序";
"pl_menu.title_multi" = "%d 个项目";
"pl_menu.play_next" = "接下来播放";
"pl_menu.play_in_new_window" = "在新窗口中播放";
"pl_menu.remove" = "移除";
"pl_menu.remove_multi" = "移除选中项";
"pl_menu.delete" = "移到废纸篓";
"pl_menu.delete_multi" = "将选中项移到废纸篓";
"pl_menu.delete_after_play" = "播放后移到废纸篓";
"pl_menu.delete_after_play_multi" = "播放后将选中项移到废纸篓";
"pl_menu.show_in_finder" = "在访达中显示";
"pl_menu.add_file" = "添加文件…";
"pl_menu.add_url" = "添加 URL…";
"pl_menu.clear_playlist" = "清除播放列表";
"pl_menu.matched_sub" = "已匹配 %d 个字幕";
"pl_menu.add_sub" = "添加字幕…";
"pl_menu.wrong_sub" = "错误的字幕！";
"pl_menu.browser" = "在浏览器中打开";
"pl_menu.copy_url" = "复制链接";
"pl_menu.copy_url_multi" = "复制链接";

"keymapping.title" = "快捷键";
"keymapping.message" = "请按任意键来开始录制。";

"filter.video_filters" = "视频滤镜";
"filter.audio_filters" = "音频滤镜";

"hwdec.no" = "禁用硬件解码。";
"hwdec.auto" = "启用硬件解码。但大多数视频滤镜不会正常工作。";
"hwdec.auto-copy" = "启用硬件解码。这将占用约两倍内存，但支持视频滤镜。";

"gaplessAudio.no" = "在音频文件之间切换时可能会出现静音或卡顿。";
"gaplessAudio.weak" = "如果解码器输出的音频格式发生改变，音频设备将被重启，并导致无缝播放卡顿。";
"gaplessAudio.yes" = "音频设备使用首个播放文件的设定参数启动，并保持参数以实现无缝播放。后续文件可能因此被重新采样。";

"subencoding.auto" = "自动识别";

"osc_toolbar.settings" = "快速设置";
"osc_toolbar.playlist" = "播放列表和章节";
"osc_toolbar.pip" = "切换“画中画”模式";
"osc_toolbar.full_screen" = "切换全屏";
"osc_toolbar.music_mode" = "进入音乐模式";
"osc_toolbar.sub_track" = "选择字幕轨道";
"osc_toolbar.screenshot" = "截图";
"osc_toolbar.plugins" = "显示插件面板";

"mini_player.album_art" = "切换专辑封面";
"mini_player.loop" = "重复";
"mini_player.shuffle" = "随机";
"mini_player.remove" = "从播放列表中移除";
"mini_player.add" = "添加到播放列表";
"mini_player.delete" = "从播放列表中删除所有曲目";
"mini_player.volume" = "音量";
"mini_player.close" = "关闭音乐模式";
"mini_player.back" = "返回视频模式";
"mini_player.sort" = "排序播放列表";

// Touch bar

"touchbar.ahead_15" = "前进 15 秒";
"touchbar.ahead_30" = "前进 30 秒";
"touchbar.back_15" = "后退 15 秒";
"touchbar.back_30" = "后退 30 秒";
"touchbar.next_video" = "下一个视频";
"touchbar.prev_video" = "上一个视频";
"touchbar.increase_volume" = "音量 +";
"touchbar.decrease_volume" = "音量 -";
"touchbar.rewind" = "快退";
"touchbar.fast_forward" = "快进";
"touchbar.play_pause" = "播放 / 暂停";
"touchbar.seek" = "查找进度";
"touchbar.time" = "进度位置";
"touchbar.remainingTimeOrTotalDuration" = "剩余时间/总时间";
"touchbar.toggle_pip" = "切换“画中画”模式";

// Plugin permissions

"permissions.network-request.name" = "网络请求";
"permissions.network-request.desc" = "此插件可以从这些网站生成请求或上传数据：";
"permissions.network-request.any_site" = "任何网站";
"permissions.show-osd.name" = "显示 OSD";
"permissions.show-osd.desc" = "此插件可以显示 OSD（屏幕显示）消息。";
"permissions.show-alert.name" = "显示通知";
"permissions.show-alert.desc" = "此插件可以显示弹出提醒。";
"permissions.video-overlay.name" = "在视频上添加叠加层";
"permissions.video-overlay.desc" = "此插件可以在视频顶部渲染附加内容。";
"permissions.file-system.name" = "访问文件系统";
"permissions.file-system.desc" = "此插件可以在磁盘上读取或写入文件，其中可能包括敏感信息。 它也可以执行其他可能伤害您的计算机的程序或应用程序。所以肯定要验证源。";

"plugin.install" = "安装";
"plugin.installed" = "已安装";
"plugin.not_installed" = "未安装";
"plugin.local" = "已安装本地文件";
"alert.plugin.install_error" = "安装过程中发生错误: %@";
"alert.invalid_url" = "URL 无效";
"plugin.install_error.invalid_url" = "URL 无效";
"plugin.install_error.file_not_found" = "找不到软件包文件。";
"plugin.install_error.cannot_download" = "下载插件失败。\n\n输出: %@\n";
"plugin.install_error.cannot_unpackage" = "解包插件失败。\n\n输出: %@\n";
"plugin.install_error.cannot_load" = "IINA无法加载此插件，可能是格式错误。";
"plugin.check_for_updates" = "检查更新";
"plugin.updating" = "下载更新中……";
